tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/extensions"
tap "shivammathur/php"
# Postgres C API library
brew "libpq"
# Dependency Manager for PHP
brew "composer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Open source relational database management system
brew "mysql", restart_service: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# General-purpose scripting language
brew "php@8.0", restart_service: true, link: true
# General-purpose scripting language
brew "php@8.1"
# Persistent key-value database, with built-in net interface
brew "redis"
# Internet file retriever
brew "wget"
# Imagick PHP extension
brew "shivammathur/extensions/imagick@7.4"
# Mcrypt PHP extension
brew "shivammathur/extensions/mcrypt@8.2"
# Mongodb PHP extension
brew "shivammathur/extensions/mongodb@7.4"
# Redis PHP extension
brew "shivammathur/extensions/redis@7.4"
# Redis PHP extension
brew "shivammathur/extensions/redis@8.0"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# Application launcher and productivity software
cask "alfred"
# Virtual Audio Driver
cask "blackhole-16ch"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Time optimising application
cask "rescuetime"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# Window manager
cask "tiles"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Equinusocio.vsc-community-material-theme"
vscode "IronGeek.vscode-env"
vscode "PKief.material-icon-theme"
vscode "sleistner.vscode-fileutils"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
