tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# GitHub command-line tool
brew "gh"
# GNU utilities for networking
brew "inetutils"
# Postgres C API library
brew "libpq"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch", restart_service: true
# Open source relational database management system
brew "mysql", restart_service: true
# Platform built on V8 to build network applications
brew "node@18"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Application launcher and productivity software
cask "alfred"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Laravel and PHP development environment manager
cask "herd"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PHP IDE by JetBrains
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Time optimising application
cask "rescuetime"
# Native GUI tool for relational databases
cask "tableplus"
# Window manager
cask "tiles"
# Tinker tool for PHP and Laravel developers
cask "tinkerwell"
# Open-source code editor
cask "visual-studio-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "IronGeek.vscode-env"
vscode "PKief.material-icon-theme"
vscode "sleistner.vscode-fileutils"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
