tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "symfony-cli/tap"
brew "apr-util"
brew "cask"
brew "openldap"
brew "curl"
brew "freetds"
brew "krb5"
brew "libpq"
brew "php", link: false
brew "composer"
brew "dnsmasq"
brew "htop"
brew "imagemagick"
brew "libfido2"
brew "mysql", restart_service: true
brew "nginx"
brew "node"
brew "openjdk"
brew "php@7.4"
brew "php@8.0", link: true
brew "pkcs11-helper"
brew "python@3.10"
brew "redis", restart_service: true
brew "mongodb/brew/mongodb-community"
brew "symfony-cli/tap/symfony-cli"
cask "alfred"
cask "google-chrome"
cask "iterm2"
cask "phpstorm"
cask "postman"
cask "rescuetime"
cask "sequel-ace"
cask "skype"
cask "slack"
cask "telegram"
cask "tiles"
cask "tinkerwell"
cask "visual-studio-code"
cask "wkhtmltopdf"
