tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/extensions" # Better pecl
tap "shivammathur/php" # Needed for PHP 7.4
brew "bat"
brew "libpq" # Required by PHP
brew "composer"
brew "dnsmasq"
brew "htop"
brew "mysql"
brew "neofetch"
brew "nginx"
brew "php@8.0"
brew "php@8.1", link: true
brew "redis"
brew "wget"
brew "shivammathur/extensions/imagick@7.4"
brew "shivammathur/extensions/mcrypt@8.2"
brew "shivammathur/extensions/mongodb@7.4"
brew "shivammathur/extensions/redis@7.4"
brew "shivammathur/extensions/redis@8.0"
brew "shivammathur/php/php@7.4"
cask "alfred"
cask "blackhole-16ch" # OBS Desktop Audio
cask "docker"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "obs"
cask "obsidian"
cask "postman"
cask "rescuetime"
cask "sequel-ace"
cask "slack"
cask "tiles"
cask "transmission"
cask "vlc"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Equinusocio.vsc-community-material-theme"
vscode "IronGeek.vscode-env"
vscode "PKief.material-icon-theme"
vscode "sleistner.vscode-fileutils"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
