tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"
brew "automake"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl-openssl"
brew "dcd"
brew "dmd"
brew "dnsmasq", restart_service: true
brew "gh"
brew "gifsicle"
brew "git"
brew "pkg-config"
brew "graphviz"
brew "groonga"
brew "htop"
brew "httrack"
brew "imagemagick"
brew "jpegoptim"
brew "libksba"
brew "libpq"
brew "libxml2"
brew "libyaml"
brew "lynx"
brew "mariadb", restart_service: true
brew "nasm"
brew "nginx", restart_service: true
brew "node@14"
brew "optipng"
brew "php", restart_service: true
brew "pngquant"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "the_silver_searcher"
brew "wget"
brew "zlib"
brew "stripe/stripe-cli/stripe"
cask "sequel-ace"
cask "shiftit"
